Repository: processout/processout-ios
Catalog: Sources/ProcessOutUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr, pl, pt_pt

# address-spec.area
source: Area
ar: المنطقة
fr: Zone
pl: Obszar
pt_pt: Região

# address-spec.city
source: City
ar: المدينة
fr: Ville
pl: Miejscowość
pt_pt: Cidade

# address-spec.county
source: County
ar: البلد
fr: Comté
pl: Hrabstwo
pt_pt: Distrito

# address-spec.department
source: Department
ar: المقاطعة
fr: Département
pl: Departament
pt_pt: Estado

# address-spec.district
source: District
ar: المقاطعة
pl: Dystrykt
pt_pt: Distrito

# address-spec.do-si
source: Do Si
ar: الولاية
fr: Province et ville

# address-spec.eircode
source: Eircode
ar: الرمز البريدي في أيرلندا

# address-spec.emirate
source: Emirate
ar: الإمارة
fr: Émirat
pl: Emiraty
pt_pt: Emirado

# address-spec.island
source: Island
ar: الجزيرة
fr: Île
pl: Wyspa
pt_pt: Ilha

# address-spec.oblast
source: Oblast
ar: المقاطعة
pl: Obwód
pt_pt: Região

# address-spec.parish
source: Parish
ar: إيبارشية
fr: Paroisse
pl: Parafia
pt_pt: Freguesia

# address-spec.pin
source: PIN
ar: رقم التعريف الشخصي

# address-spec.post-town
source: Town or city
ar: المدينة
fr: Ville
pl: Miejscowość
pt_pt: Cidade

# address-spec.postcode
source: Postal code
ar: الرمز البريدي
fr: Code postal
pl: Kod pocztowy
pt_pt: Código postal

# address-spec.prefecture
source: Prefecture
ar: الحي السكني
fr: Préfecture
pl: Prefektura
pt_pt: Distrito

# address-spec.province
source: Province
ar: الولاية
pl: Prowincja
pt_pt: Província

# address-spec.state
source: State
ar: الولاية
fr: État
pl: Stan
pt_pt: Estado

# address-spec.suburb
source: Suburb
ar: المنطقة
fr: Localité
pl: Przedmieścia
pt_pt: Localidade

# address-spec.zip
source: ZIP
ar: الرمز البريدي
fr: Code postal
pl: Kod p
pt_pt: Código postal

# cancel-confirmation.cancel
source: Not now
ar: ليس الآن
fr: Pas maintenant
pl: Nie teraz
pt_pt: Agora não

# cancel-confirmation.confirm
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# cancel-confirmation.title
source: Cancel?
ar: إلغاء؟
fr: Annuler ?
pl: Anulować?
pt_pt: Cancelar?

# card-scanner.cancel-button
source: Add manually
ar: إضافة يدويًا
fr: Ajouter manuellement
pl: Dodaj ręcznie
pt_pt: Adicionar manualmente

# card-scanner.description
source: Position your card in the frame to scan it.
ar: ضع بطاقتك داخل الإطار لمسحها ضوئيًا
fr: Placez votre carte dans le cadre pour la scanner.
pl: Umieść kartę w ramce, aby ją zeskanować.
pt_pt: Posicione o cartão na moldura para digitalizá-lo.

# card-scanner.title
source: Scan card
ar: امسح البطاقة
fr: Scanner la carte
pl: Skanowanie karty
pt_pt: Digitalizar cartão

# card-tokenization.billing-address.street
source: Address line %d
ar: سطر العنوان %d
fr: Ligne d'adresse %d
pl: Linia adresu %d
pt_pt: Endereço %d

# card-tokenization.billing-address.title
source: Billing Address
ar: عنوان إرسال الفواتير
fr: Adresse de Facturation
pl: Adres do Faktury
pt_pt: Morada de faturação

# card-tokenization.cancel-button.title
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# card-tokenization.card-details.cardholder.placeholder
source: Cardholder Name
ar: اسم حامل البطاقة
fr: Nom du porteur de carte
pl: Imię i nazwisko na karcie
pt_pt: Nome no cartão

# card-tokenization.card-details.cvc.placeholder
source: CVC
ar: كود التحقق CVV
fr: CVV

# card-tokenization.card-details.expiration.placeholder
source: MM / YY
ar: شهر / سنة
fr: MM / AA
pl: MM / RR
pt_pt: MM / AA

# card-tokenization.error.card
source: Your card information is invalid.
ar: إنَّ معلومات البطاقة غير صالحة
fr: Les informations de votre carte sont incorrectes.
pl: Niepoprawne dane karty.
pt_pt: Os dados do seu cartão são inválidos.

# card-tokenization.error.card-expiration
source: Your card expiration date is invalid.
ar: إنّ تاريخ صلاحية البطاقة غير صالح
fr: La date d'expiration de votre carte est incorrecte.
pl: Data ważności karty jest nieprawidłowa.
pt_pt: A data de validade do seu cartão é inválida.

# card-tokenization.error.card-number
source: Your card number is invalid.
ar: إنّ رقم البطاقة غير صالح
fr: Votre numéro de carte est incorrect.
pl: Nieprawidłowy numer karty.
pt_pt: O número do seu cartão é inválido.

# card-tokenization.error.cardholder-name
source: The cardholder name is invalid.
ar: اسم حامل البطاقة غير صالح
fr: Le nom du porteur de carte est incorrect.
pl: Nieprawidłowe imię i nazwisko na karcie.
pt_pt: O nome no cartão é inválido.

# card-tokenization.error.cvc
source: Your card CVC is invalid.
ar: رقم كود التحقق CVV غير صالح
fr: Le code CVV de votre carte est incorrect.
pl: Nieprawidłowy numer CVC.
pt_pt: O código de segurança do seu cartão é inválido.

# card-tokenization.error.eligibility
source: We can’t accept this card. Please try a different one.
ar: لا يمكننا قبول هذه البطاقة. يرجى المحاولة باستخدام بطاقة أخرى.
fr: Nous ne pouvons pas accepter cette carte. Veuillez en essayer une autre.
pl: Nie możemy zaakceptować tej karty. Spróbuj użyć innej.
pt_pt: Não podemos aceitar este cartão. Por favor, tente com outro.

# card-tokenization.error.generic
source: Something went wrong, please try again.
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى
fr: Une erreur s'est produite, veuillez réessayer.
pl: Coś poszło nie tak, spróbuj ponownie.
pt_pt: Ocorreu um erro ao processar o seu cartão, por favor tente novamente.

# card-tokenization.error.track-data
source: Your card expiration date and/or CVC is invalid.
ar: تاريخ انتهاء صلاحية البطاقة و/أو كود التحقق CVV غير صالح
fr: La date d'expiration de votre carte ou son code CVV sont incorrects.
pl: Data ważności karty oraz/lub kod CVC są nieprawidłowe.
pt_pt: A data de validade e/ou o código de segurança do seu cartão são inválidos.

# card-tokenization.preferred-scheme.title
source: Preferred Scheme
ar: النظام المفضل للبطاقة
fr: Réseau de Carte Préféré
pl: Preferowany Schemat
pt_pt: Rede de pagamento preferencial

# card-tokenization.save-card-message
source: Save this card for future payments
ar: احفظ تفاصيل هذه البطاقة لاستخدامها في المستقبل
fr: Enregistrer cette carte pour les paiements futurs
pl: Zapisz tę kartę na przyszłe płatności
pt_pt: Guardar este cartão para futuros pagamentos

# card-tokenization.scan-card.title
source: Scan card
ar: امسح البطاقة
fr: Scanner la carte
pl: Zeskanuj kartę
pt_pt: Digitalizar cartão

# card-tokenization.submit-button.title
source: Submit
ar: إرسال
fr: Envoyer
pl: Zatwierdź
pt_pt: Enviar

# card-tokenization.title
source: Add New Card
ar: إضافة بطاقة جديدة
fr: Ajouter une nouvelle carte
pl: Dodaj nową kartę
pt_pt: Adicionar novo cartão

# card-update.cancel-button
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# card-update.cvc
source: CVC
ar: كود التحقق CVV
fr: CVV

# card-update.error.cvc
source: Your card CVC is invalid.
ar: رقم كود التحقق CVV غير صالح
fr: Le code CVV de votre carte est incorrect.
pl: Nieprawidłowy numer CVC.
pt_pt: O código de segurança do seu cartão é inválido.

# card-update.error.generic
source: Something went wrong, please try again.
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى
fr: Une erreur s'est produite, veuillez réessayer.
pl: Coś poszło nie tak, spróbuj ponownie.
pt_pt: Ocorreu um erro ao processar o seu cartão, por favor tente novamente.

# card-update.preferred-scheme
source: Preferred Scheme
ar: النظام المفضل للبطاقة
fr: Réseau de Carte Préféré
pl: Preferowany Schemat
pt_pt: Rede de pagamento preferencial

# card-update.submit-button
source: Submit
ar: إرسال
fr: Envoyer
pl: Zatwierdź
pt_pt: Enviar

# card-update.title
source: Payment Details
ar: تفاصيل الدفع
fr: Informations de Paiement
pl: Szczegóły Płatności
pt_pt: Detalhes do pagamento

# delete-confirmation.cancel
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# delete-confirmation.confirm
source: Delete
ar: حذف
fr: Supprimer
pl: Usuń
pt_pt: Excluir

# delete-confirmation.title
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟
fr: Êtes-vous sûr de vouloir supprimer cet élément ?
pl: Czy na pewno chcesz usunąć ten element?
pt_pt: Tem certeza de que deseja excluir este item?

# dynamic-checkout.cancel-button
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# dynamic-checkout.error.generic
source: We were unable to process your payment. Please check your payment details or try another payment method.
ar: لم نتمكن من إتمام دفعتك. يرجى التحقق من التفاصيل أو تجربة طريقة دفع أخرى.
fr: Nous n'avons pas pu finaliser votre paiement. Veuillez vérifier vos informations ou essayer un autre mode de paiement.
pl: Nie byliśmy w stanie sfinalizować Twojej płatności. Zweryfikuj swoje dane lub wybierz inną metody płatności.
pt_pt: Não foi possível concluir o seu pagamento. Por favor, verifique os detalhes ou tente outro método de pagamento.

# dynamic-checkout.error.method-unavailable
source: The requested payment method is not available, please try another payment method.
ar: طريقة الدفع المطلوبة غير متاحة، يرجى تجربة طريقة دفع أخرى.
fr: Le mode de paiement demandé n'est pas disponible, veuillez essayer un autre mode de paiement.
pl: Wybrana metoda płatności nie jest obsługiwana. Proszę wybierz inną metodę.
pt_pt: O método de pagamento escolhido não está disponível, por favor tente outro método de pagamento.

# dynamic-checkout.express-checkout
source: Express checkout
ar: الدفع السريع
fr: Paiement express
pl: Szybka płatność
pt_pt: Pagamento expresso

# dynamic-checkout.pay-button
source: Pay
ar: الدفع
fr: Payer
pl: Zapłać
pt_pt: Pagar

# dynamic-checkout.redirect-warning
source: You will be redirected to finalise this payment.
ar: سيتم إعادة توجيهك لإتمام هذه الدفعة.
fr: Vous serez redirigé pour finaliser ce paiement.
pl: Zostaniesz przekierowany, aby sfinalizować tę płatność.
pt_pt: Será redireccionado para finalizar este pagamento.

# dynamic-checkout.save-payment-message
source: Save this method for future payments
ar: حِفْظُ هذِهِ الطَّريقَةِ لِلدَّفْعِ في المُستَقبَلِ
fr: Enregistrer cette méthode pour les paiements futurs
pl: Zapisz tę metodę płatności na przyszłe płatności
pt_pt: Guardar este método para futuros pagamentos

# dynamic-checkout.success-message
source: Payment approved.
ar: تمت الموافقة على الدفع
fr: Paiement confirmé.
pl: Płatność przyjęta.
pt_pt: Pagamento aprovado.

# dynamic-checkout.success-title
source: You're all set!
ar: تم كل شيء بنجاح!
fr: Tout est prêt !
pl: Wszystko gotowe!
pt_pt: Tudo pronto!

# native-alternative-payment.barcode-error.confirm
source: Got it
ar: فهمت
fr: Compris
pl: Rozumiem
pt_pt: Compreendi

# native-alternative-payment.barcode-error.message
source: We couldn't save the image. Please check your permissions or try taking a screenshot as an alternative.
ar: لم نتمكن من حفظ الصورة. يرجى التحقق من أذوناتك أو محاولة التقاط لقطة شاشة كبديل.
fr: Nous n'avons pas pu enregistrer l'image. Veuillez vérifier vos permissions ou alternativement prendre une capture d'écran.
pl: Sprawdź uprawnienia systemu lub zrób zrzut ekranu.
pt_pt: Não conseguimos gravar a imagem. Por favor, verifique as suas permissões ou tire uma captura do ecrã como alternativa.

# native-alternative-payment.barcode-error.title
source: Image save failed
ar: فشل حفظ الصورة
fr: Échec de l'enregistrement de l'image
pl: Nie udało się zapisać obrazu
pt_pt: Falha na gravação da imagem

# native-alternative-payment.cancel-button.title
source: Cancel
ar: إلغاء
fr: Annuler
pl: Anuluj
pt_pt: Cancelar

# native-alternative-payment.confirm-payment-button.title
source: I've paid
ar: لقد دفعت
fr: J’ai payé
pl: Zapłaciłem
pt_pt: Já paguei

# native-alternative-payment.continue-button.title
source: Continue
ar: متابعة
fr: Continuer
pl: Kontynuuj
pt_pt: Continuar

# native-alternative-payment.copied-button
source: Copied!
ar: تم النسخ!
fr: Copié !
pl: Skopiowano!
pt_pt: Copiado!

# native-alternative-payment.copy-button
source: Copy
ar: نسخ
fr: Copier
pl: Skopiuj
pt_pt: Copiar

# native-alternative-payment.country-placeholder
source: Country
ar: الدولة
fr: Pays
pl: Kraj
pt_pt: País

# native-alternative-payment.done-button.title
source: Done
ar: تم
fr: Terminé
pl: Gotowe
pt_pt: Concluído

# native-alternative-payment.error.invalid-length-%d
source: Invalid length, expected %d characters.
ar: إن الطول غير صالح، الرجاء التقيد بـ %d حرفًا.
fr: Longueur incorrecte, %d caractères sont attendus.
pl: Nieprawidłowa długość. Oczekiwano %d znaków.
pt_pt: Quantidade de caracteres incorreta, espera-se %d caracteres.

# native-alternative-payment.error.invalid-max-length-%d
source: Invalid length, must be at most %d characters.
ar: الطول غير صالح، يجب ألا يتجاوز %d حرفًا.
fr: Longueur invalide, ne doit pas dépasser %d caractères.
pl: Nieprawidłowa długość – maksymalnie %d znaków.
pt_pt: Comprimento inválido, no máximo %d caracteres.

# native-alternative-payment.error.invalid-min-length-%d
source: Invalid length, must be at least %d characters.
ar: الطول غير صالح، يجب أن يكون %d حرفًا على الأقل.
fr: Longueur invalide, au moins %d caractères requis.
pl: Nieprawidłowa długość – co najmniej %d znaków.
pt_pt: Comprimento inválido, no mínimo %d caracteres.

# native-alternative-payment.error.invalid-value
source: Value is not valid.
ar: القيمة غير صحيحة.
fr: Valeur invalide.
pl: Niepoprawna wartość.
pt_pt: Texto inválido.

# native-alternative-payment.error.required-parameter
source: Parameter is required.
ar: البيانات مطلوبة.
fr: Paramètre requis.
pl: Parametr jest wmagany.
pt_pt: Campo obrigatório.

# native-alternative-payment.payment-confirmation.progress.step1.title
source: Details submitted
ar: تم إرسال التفاصيل
fr: Détails envoyés
pl: Szczegóły przesłane
pt_pt: Detalhes enviados

# native-alternative-payment.payment-confirmation.progress.step2.description
source: Please wait for up to %@ minutes
ar: يرجى الانتظار حتى %@ دقيقة
fr: Veuillez patienter jusqu’à %@ minutes
pl: Poczekaj maksymalnie %@ minut
pt_pt: Aguarde até %@ minutos

# native-alternative-payment.payment-confirmation.progress.step2.title
source: Waiting for confirmation
ar: في انتظار التأكيد
fr: En attente de confirmation
pl: Oczekiwanie na potwierdzenie
pt_pt: Aguardando confirmação

# native-alternative-payment.save-barcode-button.title
source: Save %@ code
ar: احفظ رمز %@
fr: Enregistrer le code %@
pl: Zapisz kod %@
pt_pt: Guardar código %@

# native-alternative-payment.success.message
source: You paid %@
ar: لقد دفعت %@
fr: Vous avez payé %@
pl: Zapłaciłeś %@
pt_pt: Você pagou %@

# native-alternative-payment.success.title
source: You're all set!
ar: تم كل شيء بنجاح!
fr: Tout est prêt !
pl: Wszystko gotowe!
pt_pt: Tudo pronto!

# native-alternative-payment.title
source: Pay %@
ar: ادفع %@
fr: Payer %@
pl: Zapłać %@
pt_pt: Pagar %@

# payment-cancel-confirmation.cancel
source: Not now
ar: ليس الآن
fr: Pas maintenant
pl: Nie teraz
pt_pt: Agora não

# payment-cancel-confirmation.confirm
source: Cancel payment
ar: إلغاء الدفع
fr: Annuler le paiement
pl: Anuluj płatność
pt_pt: Cancelar pagamento

# payment-cancel-confirmation.title
source: Cancel payment?
ar: إلغاء الدفع؟
fr: Annuler le paiement ?
pl: Anulować płatność?
pt_pt: Cancelar pagamento?

# saved-payment-methods.content-unavailable.description
source: The next time you save a payment method, it will appear here.
ar: جميع وسائل الدفع المحفوظة ستظهر هنا في المرة القادمة.
fr: La prochaine fois que vous enregistrez une méthode de paiement, elle apparaîtra ici.
pl: Gdy następnym razem zapiszesz metodę płatności, pojawi się tutaj.
pt_pt: Depois de guardar uma forma de pagamento, ela aparecerá aqui.

# saved-payment-methods.content-unavailable.title
source: No saved payment methods
ar: لا توجد طرق دفع محفوظة
fr: Aucune méthode de paiement enregistrée
pl: Brak zapisanych metod płatności
pt_pt: Nenhuma forma de pagamento guardada

# saved-payment-methods.generic-error
source: Something went wrong, please try again.
ar: حدث خطأ ما، يرجى المحاولة مرة أخرى
fr: Une erreur s'est produite, veuillez réessayer.
pl: Coś poszło nie tak, spróbuj ponownie.
pt_pt: Ocorreu um erro ao processar o seu cartão, por favor tente novamente.

# saved-payment-methods.title
source: Manage saved payment methods
ar: إدارة طرق الدفع المحفوظة
fr: Gérer les méthodes de paiement enregistrées
pl: Zarządzaj zapisanymi metodami płatności
pt_pt: Gerir formas de pagamento guardadas

# test-3ds.challenge.accept
source: Accept
ar: قبول
fr: Accepter
pl: Zaakceptować
pt_pt: Aceitar

# test-3ds.challenge.reject
source: Reject
ar: رفض
fr: Rejeter
pl: Odrzucić
pt_pt: Rejeitar

# test-3ds.challenge.title
source: Do you want to accept the 3DS2 challenge?
ar: هل ترغب في قبول تحقيق 3DS2 ؟
fr: Souhaitez-vous accepter le défi (challenge) 3DS2 ?
pl: Czy chcesz przyjąć wyzwanie 3DS2?
pt_pt: Você quer aceitar o desafio 3DS2?
